# SetActSymbol

## Description
Procedure SetActSymbol sets the active symbol for a VectorWorks document.

```pascal
PROCEDURE SetActSymbol(name : STRING);
```

```python
def vs.SetActSymbol(name):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Name of symbol.|

## Version
Availability: from All Versions

## Category
* Objects - Symbols